# Create a Series from a Python list.

In [32]:
a=[1,2,3,3,5,6]
c=pd.Series(a)
print(c)

0    1
1    2
2    3
3    3
4    5
5    6
dtype: int64

# Create a DataFrame from a dictionary.

In [35]:
d={'City':['Kozhikode','Kannur','Malapuram'],
          "Pin":[673507,6703505,673507],
        
  }
df=pd.DataFrame(d)
df

        City      Pin
0  Kozhikode   673507
1     Kannur  6703505
2  Malapuram   673507

#  DataFrame shape and column names.

In [37]:
df=pd.DataFrame({
    'Name':['Braund','Akash','Maqbool','Saheer'],
    "age":[22,24,21,21],
    'sex':['male','male','male','male']
})
df

      Name  age   sex
0   Braund   22  male
1    Akash   24  male
2  Maqbool   21  male
3   Saheer   21  male

In [39]:
df.shape
df.columns

Index(['Name', 'age', 'sex'], dtype='object')

# Create a Series of numbers 1â€“10.

In [42]:
import numpy as np
arr=np.arange(1,10)
ser=pd.Series(arr)
print(ser)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

# Create a DataFrame with two columns: Name, Age.

In [43]:
df=pd.DataFrame({
    'Name':['Akash','Husna','Swalih','Naseef'],
    "Age":[24,21,21,24]
})
df

     Name  Age
0   Akash   24
1   Husna   21
2  Swalih   21
3  Naseef   24

# Convert a NumPy array into a DataFrame.

In [45]:
a=np.random.randint(1,10,(4,4))
c=pd.DataFrame(a)
c

   0  1  2  3
0  9  6  3  8
1  1  2  2  8
2  7  9  9  7
3  9  7  8  7

# Rename the columns of a DataFrame.

In [51]:
a=np.random.randint(1,10,(4,4))
c=pd.DataFrame(a)
c

   0  1  2  3
0  2  9  5  9
1  4  6  1  1
2  8  2  2  7
3  9  9  2  9

In [57]:
c.rename(columns={0:'One',1:'Two',2:'Three',3:'Four'},inplace=True)
c

   One  Two  Three  Four
0    2    9      5     9
1    4    6      1     1
2    8    2      2     7
3    9    9      2     9

# Add a new column to a DataFrame that calculates the square of another column.

In [59]:
c

   One  Two  Three  Four
0    2    9      5     9
1    4    6      1     1
2    8    2      2     7
3    9    9      2     9

In [65]:
a=c['squar'] = c['Four'] ** 2
c

   One  Two  Three  Four  Five
0    2    9      5     9    81
1    4    6      1     1     1
2    8    2      2     7    49
3    9    9      2     9    81